# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = [5, 783, 98.2, "Run"]
a = my_list[0]
b = my_list[1]
c = my_list[2]
d = my_list[3]
print(type(a))
print(type(b))
print(type(c))
print(type(d))