# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.

month = int(input("Укажите номер интересующего Вас месяца: "))
my_list = [0, "Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
data = my_list[month]
print(data)

print("--------------------->")
month_2 = int(input("Укажите номер интересующего Вас месяца: "))
my_dict = {1: "Зима",
           2: "Зима",
           3: "Весна",
           4: "Весна",
           5: "Весна",
           6: "Лето",
           7: "Лето",
           8: "Лето",
           9: "Осень",
           10: "Осень",
           11: "Осень",
           12: "Зима"}
print(my_dict.get(month_2))